Repository: noradlb1/Orcus-1.9.1-src-master
Catalog: Orcus.StaticCommands/Resources/StaticCommands.*.resx
Languages: de

source: Advanced
de: Erweitert

source: Arguments
de: Argumente

# ArgumentsDescription
source: Arguments the file should be executed with
de: Definiert die Argumente, die dem Prozess beim Start übergeben werden.

# Client_KillCommand_Description
source: Terminates the client process and don't let it respawn
de: Beendet den Client und verhindert einen Neustart durch Schutzmechanismen.

# Client_KillCommand_Name
source: Kill
de: Beenden

# Client_MakeAdminCommand_Description
source: Attempt to restart the client process with elevated privileges. If that fails, the client continues running with user permissions
de: Versuche, den Prozess mit erweiterten Rechten neuzustarten. Sollte dies fehlschlagen, wird der Prozess mit eingeschränkten Rechten weiter ausgeführt.

# Client_MakeAdminCommand_Name
source: Request Administrator Privileges
de: Administratorberechtigungen anfordern

# Client_PasswordRecoveryCommand_Description
source: Recover passwords and cookies on the client's pc
de: Wiederherstellen von Passwörtern und Cookies auf dem PC des Clients.

# Client_PasswordRecoveryCommand_Name
source: Password Recovery
de: Passwort-Wiederherstellung

# Client_RequestKeyLogCommand_Description
source: Force the client to send the current key log
de: Erzwinge das Senden des aktuellen Key logs.

# Client_RequestKeyLogCommand_Name
source: Request Key Log
de: Key Log anfordern

# Client_UninstallCommand_Description
source: Uninstall the client, remove all dependencies and remove all files
de: Deinstalliere den Client, entferne alle Abhängigkeiten und entferne alle Dateien.

# Client_UninstallCommand_Name
source: Uninstall
de: Deinstallieren

# Client_UpdateCommand_Description
source: Uninstall the current client, execute the new file and terminate the client
de: Deinstalliert den aktuellen Client und start die neue Datei.

# Client_UpdateCommand_Name
source: Update
de: Aktualisieren

# Client_UpdateCommand_PathDescription
source: The executable the file should be updated with
de: Die Datei, mit welcher der Client aktualisiert werden soll.

# Client_UpdateFromUrlCommand_Description
source: Download the file from the url, uninstall the current client, execute the new file and terminate the client
de: Lädt die Datei von der Url herunter, deinstalliert den Client und startet die heruntergeladene Datei.

# Client_UpdateFromUrlCommand_DownloadUrl_Description
source: The http(s) url of the file which should be downloaded
de: Der Link (HTTP(S)) der Datei, die heruntergeladen werden soll.

# Client_UpdateFromUrlCommand_FileHash
source: File Hash
de: Hash-Wert

# Client_UpdateFromUrlCommand_FileHash_Description
source: The SHA256 hash value of the file. Leave empty if no hash comparison is required.
de: Der SHA256-Hash-Wert der Datei. Leer lassen, wenn kein Hashvergleich erforderlich ist.

# Client_UpdateFromUrlCommand_Name
source: Update (Url)
de: Aktualisieren (Url)

source: Common
de: Allgemein

# Computer_WakeOnLanCommand_Description
source: Send magic packets to the clients to wake them up. Only works if the clients are in the same network like the server.
de: Schicke Magic Packets an die Clients, um sie aufzuwecken. Dies funktioniert nur, wenn der Server in dem Netzwerk der Clients ist.

# ExecutableFilesFilter
source: Executable Files|*.exe
de: Anwendungen|*.exe

source: File Check
de: Überprüfung

source: File Name
de: Dateiname

# Interaction_OpenTextInNotepadCommand_Description
source: Open the given text in Notepad so the user can read and copy it.
de: Öffnet den angegebenen Text in Notepad, sodass der Benutzer es lesen und kopieren kann.

# Interaction_OpenTextInNotepadCommand_Name
source: Open Text in Notepad
de: Öffne Text in Notepad

# Interaction_OpenTextInNotepadCommand_Text_Description
source: The text displayed in notepad.
de: Der Text, der in Notepad angezeigt werden soll.

# Interaction_OpenTextInNotepadCommand_Title_Description
source: The title of the window of notepad.
de: Der Titel des Fensters.

# Interaction_ShowBalloonTooltipCommand_Description
source: Show a simple balloon tooltip message
de: Zeigt eine einfache Sprechblase in Windows.

# Interaction_ShowBalloonTooltipCommand_Icon_Description
source: Specifies the icon for the balloon tooltip.
de: Das Icon der Sprechblase.

# Interaction_ShowBalloonTooltipCommand_Name
source: Show Balloon Tooltip
de: Öffne Sprechblase

# Interaction_ShowBalloonTooltipCommand_Text_Description
source: The text to display on the balloon tooltip.
de: Der Text, der in der Sprechblase dargestellt werden soll.

# Interaction_ShowBalloonTooltipCommand_Timeout_Description
source: The time period, in milliseconds, the balloon tip should display.
de: Die Zeit, in der die Sprechblase sichtbar sein soll.

# Interaction_ShowBalloonTooltipCommand_Title_Description
source: The title to display on the balloon tooltip.
de: Der Titel der Sprechblase.

# Interaction_ShowBalloonTooltipCommand_ValidateInput_TextCannotBeEmpty
source: The text cannot be empty
de: Der Text darf nicht leer sein.

# Interaction_ShowMessageBoxCommand_Buttons
source: Buttons
de: Schaltflächen

# Interaction_ShowMessageBoxCommand_Buttons_Description
source: Specifies which buttons to display in the message box.
de: Gibt an, welche Schaltflächen im Meldungsfeld angezeigt werden sollen.

# Interaction_ShowMessageBoxCommand_DefaultButton
source: Default Button
de: Standard-Schaltfläche

# Interaction_ShowMessageBoxCommand_DefaultButton_Description
source: Specifies the default button for the message box.
de: Gibt die Standardtaste für das Meldungsfeld an.

# Interaction_ShowMessageBoxCommand_Description
source: Open a message box. The button which was pressed by the user will be returned
de: Öffnet ein Meldungsfeld. Die Taste, die vom Benutzer gedrückt wurde, wird zurückgegeben

# Interaction_ShowMessageBoxCommand_Icon_Description
source: Specifies which icon to display in the message box.
de: Gibt an, welches Symbol im Meldungsfeld angezeigt werden soll.

# Interaction_ShowMessageBoxCommand_Name
source: Open Message Box
de: Meldungsfeld öffnen

# Interaction_ShowMessageBoxCommand_Text_Description
source: The text to display in the message box.
de: Der Text, der im Meldungsfeld angezeigt wird.

# Interaction_ShowMessageBoxCommand_Title_Description
source: The text to display in the title bar of the message box.
de: Der Text, der in der Titelleiste des Meldungsfeldes angezeigt wird.

source: Invalid file name
de: Ungültiger Dateiname

# InvalidSHA256HashValueHex
source: Invalid hash value. Please make sure that you use a SHA256 hash formatted as hexadecimal (64 chars)
de: Ungültiger Hashwert. Bitte stellen Sie sicher, dass Sie einen SHA256-Hash verwenden, der als hexadezimal formatiert ist (64 Zeichen)

source: Path
de: Pfad

# PathCannotBeEmpty
source: The path cannot be empty
de: Der Pfad darf nicht leer sein.

source: Protection
de: Schutzmaßnahmen

# ShowMessageBoxCommand_ValidateInput_TextCannotBeEmpty
source: The text cannot be empty
de: Der Text darf nicht leer sein.

# System_ChangeComputerStateCommand_ComputerState
source: Computer State
de: Computerzustand

# System_ChangeComputerStateCommand_ComputerState_Description
source: The action which should be done
de: Ändert den aktullen Computer-Zustand (z. B. schaltet diesen aus)

# System_ChangeComputerStateCommand_Description
source: Shutdown, restart or log off the computer
de: Herunterfahren, neu starten oder den Computer abmelden.

# System_ChangeComputerStateCommand_Name
source: Change Computer State
de: Computerzustand ändern

# System_ChangeWallpaperCommand_Description
source: Change the desktop wallpaper of the computer to an image from a url
de: Ändert das Desktop-Hintergrundbild des Computers zu einem Bild von einer URL.

# System_ChangeWallpaperCommand_Name
source: Change Desktop Wallpaper
de: Desktop-Hintergrundbild ändern

# System_ChangeWallpaperCommand_ValidateInput_WallpaperUrlCannotBeEmpty
source: The wallpaper url cannot be empty
de: Die Wallpaper URL darf nicht leer sein.

# System_ChangeWallpaperCommand_WallpaperStyle
source: Wallpaper Style
de: Anpassung

# System_ChangeWallpaperCommand_WallpaperStyle_Description
source: Determines how the desktop bitmap is displayed on the desktop
de: Legt fest, wie die Bild auf dem Desktop angezeigt werden soll.

# System_ChangeWallpaperCommand_WallpaperUrl
source: Wallpaper URL
de: Bild-Url

# System_ChangeWallpaperCommand_WallpaperUrl_Description
source: The http url to the wallpaper
de: Die Url zu dem neuen Hintergrundbild.

# System_DownloadAndExecuteCommand_Description
source: Download the given file from the Orcus Server and execute it
de: Lädt die angegebene Datei von dem Orcus Server herunter und führt diese aus

# System_DownloadAndExecuteCommand_ExecuteUsingService
source: Execute using Service
de: Mit Dienst ausführen

# System_DownloadAndExecuteCommand_ExecuteUsingService_Description
source: Execute the file using the Orcus Service if it is available
de: Die Datei mit dem Orcus Dienst ausführen, sofern dieser installiert ist.

# System_DownloadAndExecuteCommand_Name
source: Download and Execute
de: Herunterladen und Ausführen

# System_DownloadAndExecuteCommand_Path_Description
source: The path to the file which should be executed on the remote system
de: Der Pfad zur Datei, die auf dem entfernten System ausgeführt werden soll.

# System_DownloadAndExecuteFromUrlCommand_Description
source: Download a file from an url and execute it
de: Lädt eine Datei von einer Url herunter und führt diese aus.

# System_DownloadAndExecuteFromUrlCommand_Name
source: Download and Execute from Url
de: Herunterladen und ausführen von Url

# System_ExecuteProcessCommand_Administrator_Description
source: Execute the process with administrator privileges. This won't have an effect if the verb is set.
de: Führt den Prozess mit Administratorrechten aus. Dies wird keine Wirkung haben, wenn das Verb gesetzt ist.

# System_ExecuteProcessCommand_Arguments_Description
source: The command-line arguments to use when starting the application
de: Die Befehlszeilenargumente, die beim Starten der Anwendung verwendet werden sollen.

# System_ExecuteProcessCommand_CreateNoWindow
source: Create No Window
de: Kein Fenster erstellen

# System_ExecuteProcessCommand_CreateNoWindow_Description
source: Start the process without creating a new window. Only affects console.
de: Starte den Prozess, ohne ein Fenster zu erstellen. Dies funktioniert nur mit Konsolen-Anwendungen.

# System_ExecuteProcessCommand_Description
source: Execute the file of the given file path.
de: Führt die Datei des angegebenen Dateipfads aus.

# System_ExecuteProcessCommand_FileName_Description
source: The application to start
de: Die Anwendung, die gestartet werden soll.

# System_ExecuteProcessCommand_Name
source: Execute file
de: Datei ausführen

# System_ExecuteProcessCommand_ShellExecute
source: Shell Execute
de: Shell Ausführung

# System_ExecuteProcessCommand_ShellExecute_Description
source: Use the operating system shell to start the process.
de: Verwende die Betriebssystem-Shell, um den Prozess zu starten.

# System_ExecuteProcessCommand_ValidateInput_VerbDoesNotExist
source: The verb does not seem to be available on this computer. Do you want to continue?
de: Das Verb scheint nicht auf diesem Computer verfügbar zu sein. Möchten Sie fortfahren?

# System_ExecuteProcessCommand_Verb_Description
source: The verb to use when opening the file
de: Das Verb, das beim Öffnen der Datei verwendet werden soll

# System_ExecuteProcessCommand_WindowStyle
source: Window Style
de: Fensterstil

# System_ExecuteProcessCommand_WindowStyle_Description
source: The window style the application should adapt to.
de: Der Fensterstil, den die Anwendung übernehmen soll.

# System_ExecuteProcessCommand_WorkingDirectory
source: Working Directory
de: Arbeitsverzeichnis

# System_ExecuteProcessCommand_WorkingDirectory_Description
source: The working directory for the process. That has no effect if Shell Execute is true
de: Das Arbeitsverzeichnis für den Prozess. Das hat keine Wirkung, wenn Shell Ausführung an ist

# System_OpenWebsiteCommand_Amount
source: Amount
de: Anzahl

# System_OpenWebsiteCommand_Amount_Description
source: The amount of website instances
de: Die Anzahl der Website-Instanzen.

# System_OpenWebsiteCommand_Description
source: Open a website x times on the computer
de: Öffne eine Website x mal.

# System_OpenWebsiteCommand_Name
source: Open Website
de: Öffne Website

# System_OpenWebsiteCommand_WebsiteUrl_Description
source: The url to the website
de: Die Url der Website, die geöffnet werden soll.

# System_SystemLockCommand_Background
source: Background
de: Hintergrund

# System_SystemLockCommand_Background_Description
source: The color of the lock screen background.
de: Die Hintergrundfarbe des Sperrbildschirms

# System_SystemLockCommand_CloseWindows
source: Close windows
de: Fenster schließen

# System_SystemLockCommand_CloseWindows_Description
source: Constantly close other windows on the new desktop. That won't affect any windows the user did open in the default desktop.
de: Schließe andere Fenster auf dem neu erstellten Desktop. Dies wirkt sich nur auf die Fenster des neuen Desktops aus; die Fenster des Standardesktops bleiben unverändert.

# System_SystemLockCommand_Description
source: Lock the computer system and prevent any user interation until the command is stopped
de: Sperrt das System und verhindert jegliche Benuzterinteratkion, bis der Command gestoppt wird.

# System_SystemLockCommand_DifferentDesktop
source: Different Desktop
de: Anderer Desktop

# System_SystemLockCommand_DifferentDesktop_Description
source: Create a new desktop and set it as the default desktop. The original desktop will be restored when the command is stopped.
de: Sperrt das System und verhindert jegliche Benuzterinteratkion, bis der Command gestoppt wird. Der ursprüngliche Desktop wird wiederhergestellt, wenn der Command gestoppt wird.

# System_SystemLockCommand_DisableTaskManager
source: Disable Task Manager
de: Task-Manager deaktivieren

# System_SystemLockCommand_DisableTaskManager_Description
source: Disable the Windows Task Manager to prevent the user from killing the process. This feature requires administrator privileges.
de: Deaktiviert den Windows Task-Manager für die Dauer des Commands, um zu verhindern, dass der Benutzer den Prozess abbricht. Diese Funktion erfordert Administratorrechte.

# System_SystemLockCommand_DisableUserInput
source: Disable user input
de: Benutzereingaben deaktivieren

# System_SystemLockCommand_DisableUserInput_Description
source: Disable the mouse and keyboard. This feature requires administrator privileges.
de: Deaktiviert die Maus und die Tastatur. Diese Funktion erfordert Administratorrechte.

# System_SystemLockCommand_Message
source: Message
de: Nachricht

# System_SystemLockCommand_Message_Description
source: Display a message
de: Zeigt eine Nachricht an.

# System_SystemLockCommand_Name
source: Lock System
de: System sperren

# System_SystemLockCommand_PeriodicallySetTopWindow
source: Periodically bring to front
de: Regelmäßig nach vorne holen

# System_SystemLockCommand_PeriodicallySetTopWindow_Description
source: It may be possible that the window will be overlapped by other topmost windows. This option prevents that.
de: Es kann sein, dass das Fenster von anderen Fenstern überlappt wird. Diese Option verhindert das.

# System_SystemLockCommand_PreventClosing
source: Prevent Closing
de: Schließen verhindern

# System_SystemLockCommand_PreventClosing_Description
source: Prevent the key combination Alt+F4 and the close button in the taskbar.
de: Verhindert die Tastenkombination Alt+F4 und die Schaltfläche Schließen in der Taskleiste.

# System_SystemLockCommand_RotateScreen
source: Rotate Screen
de: Bildschirm drehen

# System_SystemLockCommand_RotateScreen_Description
source: Rotate the screen to make it difficult for the user to navigate. The screen will be restored when the command is stopped.
de: Dreht den Bildschirm, um dem Benutzer die Navigation zu erschweren. Der Bildschirm wird wiederhergestellt, wenn der Command gestoppt wird.

# System_SystemLockCommand_Topmost
source: Topmost
de: Fenster überlappen

# System_SystemLockCommand_Topmost_Description
source: Makes the window overlapping other windows.
de: Bringt das Fenster dazu, andere Fenster zu überlappen.

# TheFileDoesnotExist
source: The file "{0}" does not exist
de: Die Datei {0} wurde nicht gefunden

source: Title
de: Titel

# Update
source: Aktualisierung
de: Aktualisieren

# UrlCannotBeEmpty
source: Die URL darf nicht leer sein
de: The url can not be empty

# Visibility
source: Sichtbarkeit
de: Visibility

# WarningFileAbove5MiB
source: Die Datei {0} hat eine Dateigröße über 5 MiB. Bitte beachten Sie, dass diese Datei in den Arbeitsspeicher geladen und an jeden Client übertragen werden muss, was lange dauern kann, wenn dies eine große Anzahl an Clients betrifft. Möchten Sie fortfahren?
de: The file {0} has a size above 5 MiB. Please be aware that this file has to be loaded in the memory and be transmitted to every client which can be very slow if a huge amount of clients are targeted. Do you want to continue?
